app/controllers/serials_controller.rb

  def index
    @serials = Serial.paginate(:per_page => 10, :page => params[:page], :order => 'product')
---
SELECT * FROM `serials` ORDER BY product LIMIT 0, 10
SELECT count(*) AS count_all FROM `serials`

  def create
    @serial = Serial.new(params[:serial])

    respond_to do |format|
      if @serial.save
---
INSERT INTO `serials` (`updated_at`, `serial`, `product`, `additional_code`, `registered_to`, `reg_date`, `created_at`) VALUES('2008-12-25 20:18:20', 'ABC123', 'XYZ', '', 'Patrick Gibson', '2008-12-25', '2008-12-25 20:18:20')

  def destroy
    @serial.destroy
---
DELETE FROM `serials` WHERE `id` = 52

  def search
    if params['search']
      @serials = Serial.paginate(
        :order => 'product',
        :conditions => [ 'product LIKE ?',
          '%' + params['search'].downcase + '%' ],
        :per_page => 10,
        :page => 1)
---
SELECT * FROM `serials` WHERE (product LIKE '%test%') ORDER BY product LIMIT 0, 10
SELECT count(*) AS count_all FROM `serials` WHERE (product LIKE '%a%')

    def find_serial
      @serial = Serial.find(params[:id])
---
SELECT * FROM `serials` WHERE (`serials`.`id` = 52)